app/Controllers/Auth.php

INSERT INTO `user` (`username`, `password`, `salt`, `role`, `nama_lengkap`, `nik`, `no_hp`) VALUES ('aim', '25d55ad283aa400af464c76d713c07ad62cc5da8093113.44438236', '62cc5da8093113.44438236', 2, 'Achmad Hakim', '1232213215643265', '0812345648751')
---
    public function valid_register()
    {
        //tangkap data dari form
        $data = $this->request->getPost();

        //jalankan validasi
        $this->validation->run($data, 'register');

        //cek errornya
        $errors = $this->validation->getErrors();

        //jika ada error kembalikan ke halaman register
        if($errors){
            session()->setFlashdata('error', $errors);
            return redirect()->to('/auth/register');
        }

        //jika tdk ada error

        //buat salt
        //$salt = uniqid('', true);

        //hash password digabung dengan salt
        $password = md5($data['password']);//.$salt;

        //masukan data ke database
        $this->userModel->save([
            'username' => $data['username'],
            'password' => $password,
            'salt' => "...",
            'role' => 2,
            'nama_lengkap' => $data['namalengkap'],
            'nik' => $data['nik'],
            'no_hp' => $data['no_hp']
            ]);

SELECT *
FROM `user`
WHERE `username` = 'aim'
 LIMIT 1
---
    public function valid_login()
    {
        //ambil data dari form
        $data = $this->request->getPost();

        //ambil data user di database yang usernamenya sama
        $user = $this->userModel->where('username', $data['username'])->first();